# Fictitious Names

### Introduction:

This time you will create a data again 

Special thanks to [Chris Albon](http://chrisalbon.com/) for sharing the dataset and materials.
All the credits to this exercise belongs to him.  

In order to understand about it go [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create the 3 DataFrames based on the following raw data

In [3]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Step 3. Assign each to a variable called data1, data2, data3

In [5]:
data1 =pd.DataFrame(raw_data_1,columns={'subject_id','first_name', 'last_name'})
data2 =pd.DataFrame(raw_data_2,columns={'subject_id','first_name', 'last_name'})
data3 =pd.DataFrame(raw_data_3,columns={'subject_id','test_id'})

### Step 4. Join the two dataframes along rows and assign all_data

In [6]:
all_data = pd.concat([data1, data2])

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [9]:
 all_data_col = pd.concat([data1 , data2],axis=1)

### Step 6. Print data3

In [12]:
data3

  first_name subject_id last_name
0       Alex          1  Anderson
1        Amy          2  Ackerman
2      Allen          3       Ali
3      Alice          4      Aoni
4     Ayoung          5   Atiches

### Step 7. Merge all_data and data3 along the subject_id value

In [16]:
Merge_Data = pd.merge(all_data,data3 , on='subject_id')
Merge_Data

  first_name subject_id last_name  test_id
0       Alex          1  Anderson       51
1        Amy          2  Ackerman       15
2      Allen          3       Ali       15
3      Alice          4      Aoni       61
4      Billy          4    Bonder       61
5     Ayoung          5   Atiches       16
6      Brian          5     Black       16
7      Bryce          7     Brice       14
8      Betty          8    Btisan       15

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [17]:
Merge_only = pd.merge(all_data,data3 ,how= 'inner', on='subject_id')
Merge_only.head()

  first_name subject_id last_name  test_id
0       Alex          1  Anderson       51
1        Amy          2  Ackerman       15
2      Allen          3       Ali       15
3      Alice          4      Aoni       61
4      Billy          4    Bonder       61

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.

In [18]:
Merge_all = pd.merge(data1,data2 ,how= 'outer', on='subject_id')
Merge_all.head()

  first_name_x subject_id last_name_x first_name_y last_name_y
0         Alex          1    Anderson          NaN         NaN
1          Amy          2    Ackerman          NaN         NaN
2        Allen          3         Ali          NaN         NaN
3        Alice          4        Aoni        Billy      Bonder
4       Ayoung          5     Atiches        Brian       Black